Revit 2026 API

# BalusterPatternDuplicateBaluster Method

---

Duplicates the baluster pointed by given index in the main baluster pattern.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BalusterInfo DuplicateBaluster(
	int index
)
```
```vb
Public Function DuplicateBaluster (
	index As Integer
) As BalusterInfo
```
```cpp
public:
BalusterInfo^ DuplicateBaluster(
	int index
)
```
```fsharp
member DuplicateBaluster :
        index : int -> BalusterInfo
```

#### Parameters

index Int32
     Baluster index.

#### Return Value

BalusterInfo The duplicated baluster.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The index index is out of range. |

The new baluster will be inserted just after the source baluster.

#### Reference

BalusterPattern Class

Autodesk.Revit.DB.Architecture Namespace